app/views/users/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 6]]
---
            <tbody>
                <% @users.books.each do |f| %>