app/controllers/books_controller.rb

    def show
        @user = current_user
        @book = Book.new
        @books = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        user = User.find(params[:user_id])
        book = current_user.books.new(books_params)
        book.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "マスタリングTCP/IP 入門編"], ["body", "☆（ゝω・）vｷｬﾋﾟ"], ["user_id", 2], ["created_at", "2020-02-02 17:31:52.944233"], ["updated_at", "2020-02-02 17:31:52.944233"]]