app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 4]]
---
    def show
        users = Book.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def create
        @user = User.find(current_user.id)