app/controllers/books_controller.rb

    def books
        @user = current_user
        @book = Book.new
        @books = Book.all
---
SELECT "books".* FROM "books"

    def show
        @user = current_user
        @book = Book.new
        @books = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def create
        @user = User.find(current_user.id)
        @book = current_user.books.new(books_params)
        @books = Book.all
        if @book.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aaaa"], ["body", "fasdfa"], ["user_id", 2], ["created_at", "2020-02-04 20:18:23.305047"], ["updated_at", "2020-02-04 20:18:23.305047"]]

    def update
        @book = Book.find(params[:id])
        if @book.update(books_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "a"], ["updated_at", "2020-02-04 19:54:01.836083"], ["id", 2]]